Конфигурация/DataProcessors/ИмпортРасчетныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортРасчетныхЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортироватьТолькоОтсутствующиеКотировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ИмпортРасчетныхЦен/Ext/ManagerModule.bsl
Процедура ИмпортироватьРасчетныеЦеныПоНовымЦеннымБумагам(ЦеннаяБумага, Источник = Неопределено) Экспорт
	
	ДатаОкончанияПериода = ТекущаяДатаСеанса();
	
	ОбработкаИмпортРасчетныхЦен = Обработки.ИмпортРасчетныхЦен.Создать();
				
	ОбработкаИмпортРасчетныхЦен.Период.ДатаНачала = Справочники.Календари.ДобавитьКДатеРабочиеДни(
		Константы.ОсновнойКалендарьКотировок.Получить(),
		ДатаОкончанияПериода,
		-92);
	ОбработкаИмпортРасчетныхЦен.Период.ДатаОкончания = ДатаОкончанияПериода;
	ОбработкаИмпортРасчетныхЦен.ЦеннаяБумага = ЦеннаяБумага;
	ОбработкаИмпортРасчетныхЦен.ИмпортироватьТолькоОтсутствующиеКотировки = Ложь;
	
	Если ЗначениеЗаполнено(Источник) Тогда
		ОбработкаИмпортРасчетныхЦен.ДополнительныеСвойства.Вставить("Источник", Источник);
	КонецЕсли;

	ОбработкаИмпортРасчетныхЦен.ЗагрузитьРасчетныеЦеныПоСтаройМетодикеНРДизЭкстерналс();
	ОбработкаИмпортРасчетныхЦен.ЗагрузитьРасчетныеЦеныПоНовойМетодикеНРД();
	
КонецПроцедуры //ИмпортироватьРасчетныеЦеныПоНовымЦеннымБумагам
